{
  "map": [
    {
      "key": "URL",
      "value": {
        "order": -2,
        "reply": "https://known-answers.azurewebsites.net/post"
      }
    },
    {
      "key": "NOT_FOUND",
      "value": {
        "order": -1,
        "reply": "This answer is incorrect. Use the back button to go back to the question."
      }
    },
    {
      "key": "FIRST_QUESTION",
      "value": {
        "order": 0,
        "reply": "Start the introduction by clicking <a href='/api/question?answer=intro'>here</a>."
      }
    },
    {
      "key": "intro",
      "value": {
        "order": 1,
        "reply": "Introduction question! How much is 1 + 1? <br><br>(enter the answer in the address bar as the value of the query parameter answer)"
      }
    },
    {
      "key": 2,
      "value": {
        "order": 2,
        "reply": "What is the second decimal of pi?"
      }
    },
    {
      "key": 4,
      "value": {
        "order": 3,
        "reply": "The 19 in covid-19 is an abbreviation for which number?"
      }
    },
    {
      "key": 2019,
      "value": {
        "order": 4,
        "reply": "This is the end of the introduction!"
      }
    },
    {
      "key": "start",
      "value": {
        "order": 5,
        "reply": "During a test Bouke discovers a bug. He knows the bug is introduced in the last 2000 commits, so he applies a binary search to find the commit that caused the bug. In case the middle commit will result in a decimal value, Bouke will always round up. How often will he have to checkout in order to find the offending commit?"
      }
    },
    {
      "key": 11,
      "value": {
        "order": 6,
        "reply": "How many times can you find the words listed in file <a href='https://raw.githubusercontent.com/BoukeNijhuis/haystack-needle/master/Needles.txt' target='_blank'>needles</a> in file <a href='https://raw.githubusercontent.com/BoukeNijhuis/haystack-needle/master/Haystack.txt' target='_blank'>haystack</a>? Please note that words can be part of longer words like 'no' is part of 'mono'. If this happens you count them both."
      }
    },
    {
      "key": 718,
      "value": {
        "order": 7,
        "reply": "You've arrived at an unknown island. While looking around you are being greeted by a local. As you went on a surprise trip organized by one of your friends you don't actually know where you ended up, but they said it would be great. After chatting with the local for a while you become rather confused. They said they are 120 years old. They seemed very knowledgeable, but 120 years old?! When you tell them your age they tell you they don´t use a decimal system, but a quinary system. In other words the only numbers they know are 0 1 2 3 and 4. What you consider a 7 is a 12 for them and their 21 translates to 11 for you. Now how old was this friendly local in the decimal system?"
      }
    },
    {
      "key": 35,
      "value": {
        "order": 8,
        "reply": "Great you know his age, but they don't know yours yet. What would your age be in the quinary system? (You are 28 year old)."
      }
    },
    {
      "key": 103,
      "value": {
        "order": 9,
        "reply": "The local you met earlier has a puzzle for you to solve. The rules are simple. If the the number is odd you will multiply by 3 and add 1 and when the number is even you will divide by 2. Example: Take number 7. The sequence is as follows: 7, 22, 11, 34, 17, 52, 26, 13, 40, 20, 10, 5, 16, 8, 4, 2, 1 Now your number is 27, how many steps do you need to reach 1."
      }
    },
    {
      "key": 111,
      "value": {
        "order": 10,
        "reply": "You are given a grid of dots. Find as many squares inside this grid as possible. Squares may be placed diagonally, so they don't necessarily have to follow the grid. For example, in a grid that is 4x3 dots you can find 10 squares. How many squares can you find if we add another line of dots, so the grid becomes 4x4?<br><br> See grid below: <br> <pre> .  .  .  .<br> .  .  .  .<br> .  .  .  .<br> .  .  .  .</pre>"
      }
    },
    {
      "key": 20,
      "value": {
        "order": 11,
        "reply": "The number 3960091 is the result of two (positive) integers multiplied. Find those two integers and calculate the final answer by adding those two integers together.<br /><br />Example:<br />The number is 15. Multiplying 3 and 5 yields 15, so the final answer is 3 + 5 = 8<br /><br />Possible hints:<br />- The answer only has one valid combination, so the integers you are after are prime numbers -> Maybe use a list of prime numbers?<br />- Both integers are over 500, leaving a range of 500 to about 8000, instead of 3 - 1.300.000<br />"
      }
    },
    {
      "key": 3980,
      "value": {
        "order": 12,
        "reply": "This is the end!"
      }
    }
  ]
}
